package com.javarush.quest.zonov.constants;

public class NpcPhrasesConstants {

    /* index.jsp */
    public static final String QUEST_OF_HEROES = "Quest Of Heroes";
    public static final String YOUR_NATIVE_LAND_IN_DANGER = "Земля твоих предков в опасности!";
    public static final String LOGIN_INVITATION = "Тебя ждет большое приключение, пройдя которое ты не останешься прежним, " +
            "ты столкнёшься, возможно, с самым трудным испытанием в твоей жизни, вводи имя, если готов";

    /* lose.jsp */
    public static final String SORRY = "Сожалею, ";
    public static final String YOURE_KILLED_BY_INNKEAPER = "Но хозяин трактира не тот, кому можно грубить, " +
            "он уничтожил тебя одним мощным заклинанием раньше, чем ты успел закончить свою фразу!";
    public static final String BE_POLITE = "В Королевстве привыкли следить за своим языком... " +
            "никогда не знаешь, кто может скрываться под видом обычного трактирщика. Ты был убит при попытке выйти из таверны.";
    public static final String TOO_HONEST = "Эх, говорил же я, что в Королевстве никому нельзя доверять... твой честный " +
            "план был тут же донесен узурпатору. Не успев дойти до замка, ты был схвачен и убит одним метким выстрелом " +
            "королевского телохранителя";
    public static final String YOU_ARE_PARANOID = "Твоя паранойя и недоверие другим съели тебя настолько, что ты убил " +
            "единственного, кто мог реально помочь тебе в атаке на замок, " +
            "без колдуна ты обречён, возвращаясь в свой город ты был убит за попытку мятежа, ведь крысу ты так и не поймал...";
    public static final String YOU_ARE_MISSED = "У тебя был единственный шанс, но ты промахнулся... после твоего промаха " +
            "в городе началась настоящая резня... ты успел скрыться, но сможешь ли ты с этим жить?";
    public static final String YOU_WAIT_TOO_MUCH_TIME = "Ты ждал слишком долго у двери, не решаясь войти, пока нас не " +
            "перерезали королевские асcаcсины, вернувшиеся после жесточайшего подавления мятежа. Последняя надежда на " +
            "спасение Королевства потеряна...";
    public static final String YOU_AIM_TOO_LONG = "Ты слишком долго целился, узурпатору удалось сбежать... мы уж было " +
            "забыли о нём, начали восстанавливать город. Через месяц он вернулся с целым легионом и стёр с лица земли наш " +
            "город, мне и еще трём людям чудом удалось спастись из этого котла... Надеюсь, что тебе не придётся пережить то, " +
            "что пережили мы...";

    /* win.jsp */
    public static final String CONGRATULATIONS = "Поздравляю, ";
    public static final String IT_WAS_AMAZING = "Не думал, что можно так ловко использовать свой ";
    public static final String YOU_ARE_GREAT_WARRIOR = "Ты не зря носишь свой ";
    public static final String AFTER_HIT_AFAR = ". После твоего меткого попадания, у семьи узурпаторов не осталось " +
            "возможности и дальше незаконно занимать трон Королевства. Истинный наследник воцарился и все жители вздохнули " +
            "с облегчением. Тебе был предложен пост генерального советника по обороне, но ты, ожидаемо, отказался. " +
            "Куда заведет тебя твоя судьба - неизвестно, надеюсь, что еще встретимся, удачи тебе, великий ";
    public static final String AFTER_KILLING_FROM_DOOR = ". Ворвавшись в двери тронного зала, мы не встретили совершенно " +
            "никакого сопротивления, вся стража была занята подавлением несуществующего мятежа. Буквально в один прыжок ты " +
            "настиг узурпатора, не дав ему и шанса на спасение. Истинный наследник воцарился и все жители вздохнули с " +
            "облегчением. Тебе был предложен пост генерального советника по обороне, но ты, ожидаемо, отказался. Куда " +
            "заведет тебя твоя судьба - неизвестно, надеюсь, что еще встретимся, удачи тебе, великий ";
    public static final String AFTER_BLIND_KILL = ". Я до сих пор не могу поверить, что ты смог одним ударом разделаться " +
            "с врагом  кромешной тьме... воистину, ты тот, кого следует бояться каждому на стороне твоих врагов! Несмотря " +
            "на большое количество жертв, жизнь в Королевстве налаживается, законный наследник занял престол и теперь всё " +
            "у нас будет хорошо. Иди с миром, воин, следуй за своей судьбой, надеюсь, что твой путь будет безопасен. В истории " +
            "Королевства ты навсегда запомнишься, как великий ";
    public static final String AFTER_KILL_ON_HORSE = ". Вот это выстрел, я не поверил своим глазам! Жаль, конечно, что " +
            "город еще долго придётся восстанавливать... но эти проблемы не сравняться с той радостью, что ты принес нашему " +
            "народу! Истинный король занял свой трон и теперь мы можем заняться развитием экономики и исследованием новых " +
            "земель. Кто знает, может, мы еще встретимся на неизведанных просторах нашей земли. До свидания, великий ";
    /* tavern.jsp */
    public static final String GREETINGS = "Приветствую тебя, ";
    public static final String WHAT_ARE_YOU_DOING_HERE = "Не часто встретишь вас в наших краях, что привело тебя сюда?";
    public static final String THATS_GOOD = "Это хорошо!";
    public static final String I_HAVE_A_JOB = "Как раз есть одна работёнка для отчаянного ";
    public static final String GO_IF_YOU_READY = "Раз готов, пойдём выйдем, здесь слишком много посторонних глаз и ушей";

    /* outsideTavern.jsp */
    public static final String COME_TO_ME = "Подходи сюда, ";
    public static final String THERE_ARE_DIFFICULT_IN_KINGDOM = "Итак, как ты, наверное, уже понял - в Королевстве " +
            "сейчас не всё спокойно. Ополчению нужна помощь, но верить нельзя никому - это главное, что ты должен уяснить.";
    public static final String GET = "Держи ";
    public static final String NEVER_RELAX = " рядом, и никогда не расслабляйся!";
    public static final String I_KNOW_YOU = "Мне известно, что ты способный воин, служивший короне много лет, то, " +
            "что ты здесь оказался - совершенно не случайно, поверь старому колдуну. " +
            "Мои люди готовы следовать за тобой, но нужно знать, как мы будем действовать - скрытно или напролом?";
    public static final String GREAT_IDEA = "Отличный выбор, без лишнего риска, верные люди сейчас на вес золота. Пойдём " +
            "скорее с улиц, пока ещё можно укрыться в ночи";
    public static final String I_CAN_FIND_SOME_PEOPLE = "Что ж, уверен, что мы найдем парочку парней, готовых пожертвовать " +
            "собой ради общего блага, пошли скорее, пока стража не начала предрассветный обход";

    /* cave.jsp silentMode */
    public static final String WELL_DONE = "Наконец-то мы в безопасности, ";
    public static final String WE_WILL_WIN_SOON = "Парни, я привёл того, о ком так много рассказывал, мы на финишной " +
            "прямой! Скоро мы расправимся с проклятым узурпатором трона! Все слушаем мудрого ";

    /* cave.jsp baldHeadMode */
    public static final String YOU_WANNA_FIGHT = "Полагаю тебе уже не терпится в бой, ";
    public static final String THIS_IS_THAT_DAY = "Что ж, парни, мы знали, что этот момент наступит. Тот самый день, " +
            "когда каждый из нас поставит на карту свою жизнь. Я привел того, кто поведет нас к этой долгожданной победе. " +
            "послушаем же нашего полководца. Я смотрю, что-то тревожит тебя, друг";
    public static final String WE_GO_WITH_YOU = "Веди нас, мы готовы пойти за тобой! Но я вынужден спросить еще раз, мы " +
            "движемся напролом или сделаем всё тихо? Хотелось бы избежать бессмысленных жертв";

    /* castle.jsp silentMode */
    public static final String ALRIGHT = "Хорошо, ";
    public static final String WE_UNDER_THE_WALL = "Мы под одной из стен замка, по данным, полученным от нашего разведчика, " +
            "узурпатор находится в тронном зале, отсюда два пути - через канализацию или через стену, какой ты выберешь? " +
            "В первом случае мы выйдем из люка в кладовой, откуда до тронного зала нужно будет дойти по замку. Во втором " +
            "- тронный зал будет виден в окно и при особой меткости, можно попробовать уничтожить узурпатора, не входя в замок";
    public static final String I_SEE_HIM = "Смотри! Я вижу его, он стоит спиной к окну, нужно действовать!";
    public static final String HIT_PROBABILITY = "Возможность попадания составляет ";
    public static final String KILL_PROBABILITY = "Возможность благоприятного исхода составляет ";
    public static final String GO_FASTER = "Отлично, мы внутри, пошли скорее, нужно подняться по лестнице на второй этаж";
    public static final String KILL_HIM = "Так, за этой дверью тронный зал, узурпатор внутри, нужно заходить внутрь и " +
            "надеяться, что мы с тобой справимся";

    /* castle.jsp baldHeadMode */
    public static final String YEAH = "Да уж, ";
    public static final String WE_MAKE_BIG_MESS = "Ну и заварушку мы устроили... города пылает, это не мятеж, а настоящая " +
            "война, итак, каков план? Как выманить узурпатора из замка?";
    public static final String WE_IN_CASTLE = "В замок мы прорвались, узурпатор, наверняка, находится в катакомбах, нужно " +
            "бежать туда";
    public static final String WE_IN_THE_CATACOMBS = "Мы в катакомбах, здесь темно, хоть глаз коли... нужно полагаться " +
            "лишь на свой слух... он где-то здесь, я чую это";
    public static final String WALL_EXPLODED = "Стена взорвана, а вместе с ней и пара сотен солдат... Смотри он убегает, " +
            "за ним, в погоню!";
    public static final String WE_CHASING = "Мы уже выехали из города, его конь - самый быстрый во всем Королевстве, на " +
            "дороге его не догнать, нужно стрелять!";
}
